In [1]:
import pandas as pd

In [6]:
pip install openpyxl

Note: you may need to restart the kernel to use updated packages.Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-2.0.0-py3-none-any.whl.metadata (2.7 kB)
Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
   ---------------------------------------- 0.0/250.9 kB ? eta -:--:--
   ---------------------------------------- 0.0/250.9 kB ? eta -:--:--
   - -------------------------------------- 10.2/250.9 kB ? eta -:--:--
   ------ -------------------------------- 41.0/250.9 kB 393.8 kB/s eta 0:00:01
   ----------------------------- ---------- 184.3/250.9 kB 1.4 MB/s eta 0:00:01
   ---------------------------------------- 250.9/250.9 kB 1.7 MB/s eta 0:00:00
Downloading et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5

[notice] A new release of pip is available: 24.0 -> 25.0.1
[notice] To update, run: C:\Users\91814\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.11_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

In [7]:
df1 = pd.read_excel(r"C:\Users\91814\Downloads\Data for ETL Assignment.xlsx", sheet_name="Customers")

In [8]:
df1.head()

,customer_id,first_name,last_name,email,phone_number,created_at
0,1,Regina,Banks,kjones@petty.biz,374.831.2327x000,2022-11-20 19:15:32
1,2,Mark,Pena,mercedes42@warner.com,001-698-370-1197x3825,2025-02-08 03:18:03
2,3,Amanda,Carney,ricardosimmons@gmail.com,946-520-9112,2022-06-28 09:04:15
3,4,Brandon,Lee,kelleycharles@hotmail.com,915.139.9155x10333,2023-03-06 14:40:08
4,5,Theresa,Ramirez,amybrown@butler.biz,(307)514-8871x86410,2024-08-19 05:20:11

In [10]:
df2 = pd.read_excel(r"C:\Users\91814\Downloads\Data for ETL Assignment.xlsx",sheet_name="Products")

In [11]:
df2

,product_id,product_name,category,price,stock_quantity,created_at
0,1,Money Wear,Toys,234.12,238,2023-08-23 13:17:46
1,2,Remain Item,Sports,115.50,240,2024-06-17 08:50:24
2,3,True Gadget,Electronics,107.63,90,2025-01-15 02:58:29
3,4,Southern Gadget,Clothing,108.82,239,2022-05-27 14:34:01
4,5,Resource Wear,Clothing,103.66,423,2021-03-05 14:09:38
...,...,...,...,...,...,...
95,96,Against Device,Books,66.85,244,2023-04-30 18:40:09
96,97,All Wear,Toys,496.07,385,2022-08-15 10:12:15
97,98,Include Gadget,Clothing,416.28,288,2021-06-28 17:52:04
98,99,Address Device,Electronics,315.38,422,2021-05-29 22:26:06
99,100,Hope Tool,Toys,78.27,60,2021-11-20 07:02:04

In [60]:
df3 = pd.read_excel(r"C:\Users\91814\Downloads\Data for ETL Assignment.xlsx",sheet_name="Orders")

In [61]:
df3

,order_id,customer_id,order_date,total_amount,status,Product_id
0,1,82,2024-01-17 19:11:33,163.94,Delivered,56
1,2,10,2022-05-11 02:09:15,334.71,Shipped,66
2,3,74,2020-05-20 20:11:19,674.77,Cancelled,6
3,4,22,2024-08-01 06:28:08,995.61,Delivered,48
4,5,19,2022-09-01 10:24:57,747.65,Shipped,35
...,...,...,...,...,...,...
195,196,28,2024-02-17 10:04:28,773.95,Shipped,95
196,197,98,2022-08-07 21:36:46,871.39,Cancelled,27
197,198,36,2024-11-26 20:42:36,712.46,Shipped,98
198,199,86,2020-05-13 20:20:52,104.72,Delivered,29
199,200,29,2023-07-12 21:42:01,52.29,Pending,62

In [55]:
import numpy as np
df3["Product_id"] = np.random.randint(1,100)

In [57]:
df3["Product_id"].nunique()

1

In [14]:
df4 = pd.read_excel(r"C:\Users\91814\Downloads\Data for ETL Assignment.xlsx",sheet_name="Payments")

In [15]:
df4

,payment_id,order_id,payment_method,payment_status,payment_date,amount_paid
0,1,197,PayPal,Completed,2021-08-07 05:44:03,627.38
1,2,173,Bank Transfer,Completed,2022-03-01 11:16:15,46.76
2,3,107,Debit Card,Completed,2024-02-26 18:44:29,586.88
3,4,185,Credit Card,Pending,2022-01-25 22:34:56,293.61
4,5,141,Cash On Delivery,Failed,2024-01-02 15:03:18,377.65
...,...,...,...,...,...,...
195,196,31,Credit Card,Pending,2022-02-16 16:46:29,349.32
196,197,79,PayPal,Refunded,2021-11-13 20:45:17,466.62
197,198,77,Debit Card,Failed,2021-09-05 11:26:14,929.56
198,199,190,Debit Card,Completed,2022-12-13 07:16:07,959.95
199,200,6,Cash On Delivery,Pending,2021-04-29 17:28:55,612.10

In [16]:
df1.isnull().sum()

customer_id     0
first_name      0
last_name       0
email           0
phone_number    0
created_at      0
dtype: int64

In [17]:
df2.isnull().sum()

product_id        0
product_name      0
category          0
price             0
stock_quantity    0
created_at        0
dtype: int64

In [62]:
df3.isnull().sum()

order_id        0
customer_id     0
order_date      0
total_amount    0
status          0
Product_id      0
dtype: int64

In [19]:
df4.isnull().sum()

payment_id        0
order_id          0
payment_method    0
payment_status    0
payment_date      0
amount_paid       0
dtype: int64

In [20]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   customer_id   100 non-null    int64
 1   first_name    100 non-null    object
 2   last_name     100 non-null    object
 3   email         100 non-null    object
 4   phone_number  100 non-null    object
 5   created_at    100 non-null    datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(4)
memory usage: 4.8+ KB

In [21]:
df1.tail(10)

,customer_id,first_name,last_name,email,phone_number,created_at
90,91,Larry,Lee,dpowers@hotmail.com,+1-407-986-0333x883,2024-02-03 16:59:56
91,92,Andrea,Jenkins,piercejohn@gonzales.com,(406)192-5207,2022-07-31 01:21:22
92,93,Brenda,Edwards,harrisalexander@flores.com,611.937.8361x4071,2025-01-28 13:09:28
93,94,Denise,Sullivan,alyssa10@vaughn-scott.com,+1-434-260-4446,2021-03-24 18:42:42
94,95,Kathleen,Gardner,marilyn16@hotmail.com,001-065-411-3296x274,2023-02-13 12:28:07
95,96,Brittany,Lopez,ysanchez@duncan.com,149.832.9366x605,2021-07-05 15:29:03
96,97,Benjamin,Cantrell,crystal86@wells.com,143.924.3829x64356,2021-10-08 11:21:26
97,98,Bailey,Jones,carrollcharles@yahoo.com,001-660-204-0662x57909,2022-12-06 18:54:50
98,99,Adam,Perkins,uluna@smith.net,(675)384-0611x255,2020-10-22 06:07:08
99,100,Patrick,Bond,daniel94@smith.net,916-323-1800x44661,2021-06-01 06:39:22

In [22]:
df2.head()

,product_id,product_name,category,price,stock_quantity,created_at
0,1,Money Wear,Toys,234.12,238,2023-08-23 13:17:46
1,2,Remain Item,Sports,115.50,240,2024-06-17 08:50:24
2,3,True Gadget,Electronics,107.63,90,2025-01-15 02:58:29
3,4,Southern Gadget,Clothing,108.82,239,2022-05-27 14:34:01
4,5,Resource Wear,Clothing,103.66,423,2021-03-05 14:09:38

In [23]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   product_id      100 non-null    int64
 1   product_name    100 non-null    object
 2   category        100 non-null    object
 3   price           100 non-null    float64
 4   stock_quantity  100 non-null    int64
 5   created_at      100 non-null    datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(2), object(2)
memory usage: 4.8+ KB

In [63]:
df3.head()

,order_id,customer_id,order_date,total_amount,status,Product_id
0,1,82,2024-01-17 19:11:33,163.94,Delivered,56
1,2,10,2022-05-11 02:09:15,334.71,Shipped,66
2,3,74,2020-05-20 20:11:19,674.77,Cancelled,6
3,4,22,2024-08-01 06:28:08,995.61,Delivered,48
4,5,19,2022-09-01 10:24:57,747.65,Shipped,35

In [26]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   order_id      200 non-null    int64
 1   customer_id   200 non-null    int64
 2   order_date    200 non-null    datetime64[ns]
 3   total_amount  200 non-null    float64
 4   status        200 non-null    object
dtypes: datetime64[ns](1), float64(1), int64(2), object(1)
memory usage: 7.9+ KB

In [27]:
df4.head()

,payment_id,order_id,payment_method,payment_status,payment_date,amount_paid
0,1,197,PayPal,Completed,2021-08-07 05:44:03,627.38
1,2,173,Bank Transfer,Completed,2022-03-01 11:16:15,46.76
2,3,107,Debit Card,Completed,2024-02-26 18:44:29,586.88
3,4,185,Credit Card,Pending,2022-01-25 22:34:56,293.61
4,5,141,Cash On Delivery,Failed,2024-01-02 15:03:18,377.65

In [28]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   payment_id      200 non-null    int64
 1   order_id        200 non-null    int64
 2   payment_method  200 non-null    object
 3   payment_status  200 non-null    object
 4   payment_date    200 non-null    datetime64[ns]
 5   amount_paid     200 non-null    float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(2)
memory usage: 9.5+ KB

In [29]:
df1.head(2)

,customer_id,first_name,last_name,email,phone_number,created_at
0,1,Regina,Banks,kjones@petty.biz,374.831.2327x000,2022-11-20 19:15:32
1,2,Mark,Pena,mercedes42@warner.com,001-698-370-1197x3825,2025-02-08 03:18:03

In [30]:
df1["phone_number"] = df1["phone_number"].str.replace(".",'-')
df1["phone_number"] = df1["phone_number"].str.replace('x','-')

In [31]:
df1

,customer_id,first_name,last_name,email,phone_number,created_at
0,1,Regina,Banks,kjones@petty.biz,374-831-2327-000,2022-11-20 19:15:32
1,2,Mark,Pena,mercedes42@warner.com,001-698-370-1197-3825,2025-02-08 03:18:03
2,3,Amanda,Carney,ricardosimmons@gmail.com,946-520-9112,2022-06-28 09:04:15
3,4,Brandon,Lee,kelleycharles@hotmail.com,915-139-9155-10333,2023-03-06 14:40:08
4,5,Theresa,Ramirez,amybrown@butler.biz,(307)514-8871-86410,2024-08-19 05:20:11
...,...,...,...,...,...,...
95,96,Brittany,Lopez,ysanchez@duncan.com,149-832-9366-605,2021-07-05 15:29:03
96,97,Benjamin,Cantrell,crystal86@wells.com,143-924-3829-64356,2021-10-08 11:21:26
97,98,Bailey,Jones,carrollcharles@yahoo.com,001-660-204-0662-57909,2022-12-06 18:54:50
98,99,Adam,Perkins,uluna@smith.net,(675)384-0611-255,2020-10-22 06:07:08
99,100,Patrick,Bond,daniel94@smith.net,916-323-1800-44661,2021-06-01 06:39:22

In [32]:
import re

In [60]:
# def clean_phone(phone_number):
#   phone_number = re.sub(r'\d','',phone_number)

In [33]:
# df1["phone_number"].apply(clean_phone)

In [71]:
from sqlalchemy import create_engine,text

In [35]:
import urllib.parse

In [36]:
pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\91814\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (9.1.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 25.0.1
[notice] To update, run: C:\Users\91814\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.11_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

In [37]:
pip install sqlalchemy pymysql

Requirement already satisfied: sqlalchemy in c:\users\91814\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (2.0.36)
Collecting pymysql
  Using cached PyMySQL-1.1.1-py3-none-any.whl.metadata (4.4 kB)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\91814\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from sqlalchemy) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\91814\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from sqlalchemy) (3.1.1)
Using cached PyMySQL-1.1.1-py3-none-any.whl (44 kB)
Installing collected packages: pymysql
Successfully installed pymysql-1.1.1
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 25.0.1
[notice] To update, run: C:\Users\91814\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.11_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

In [65]:
username = "root"
password = urllib.parse.quote_plus("Charan@8143")
host = "127.0.0.1"
port = 3306
database = "ecommerce_db"

In [66]:
engine = create_engine(f"mysql+pymysql://{username}:{password}@{host}/{database}")

In [40]:
df1.to_sql(name="Customers",con=engine,if_exists="replace",index=False)

C:\Users\91814\AppData\Local\Temp\ipykernel_20468\3889666729.py:1: UserWarning: The provided table name 'Customers' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  df1.to_sql(name="Customers",con=engine,if_exists="replace",index=False)

100

In [41]:
df2.to_sql(name="Products",con=engine,if_exists="replace",index=False)

C:\Users\91814\AppData\Local\Temp\ipykernel_20468\4031353785.py:1: UserWarning: The provided table name 'Products' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  df2.to_sql(name="Products",con=engine,if_exists="replace",index=False)

100

In [69]:
df3.to_sql(name="Orders",con=engine,if_exists="replace",index=False)

C:\Users\91814\AppData\Local\Temp\ipykernel_20468\878697245.py:1: UserWarning: The provided table name 'Orders' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  df3.to_sql(name="Orders",con=engine,if_exists="replace",index=False)

200

In [43]:
df4.to_sql(name="Payments",con=engine,if_exists="replace",index=False)

C:\Users\91814\AppData\Local\Temp\ipykernel_20468\1667165315.py:1: UserWarning: The provided table name 'Payments' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  df4.to_sql(name="Payments",con=engine,if_exists="replace",index=False)

200

In [70]:
pip install mysqlclient

Collecting mysqlclientNote: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 25.0.1
[notice] To update, run: C:\Users\91814\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.11_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

  Downloading mysqlclient-2.2.7-cp311-cp311-win_amd64.whl.metadata (4.8 kB)
Downloading mysqlclient-2.2.7-cp311-cp311-win_amd64.whl (207 kB)
   ---------------------------------------- 0.0/207.7 kB ? eta -:--:--
   - -------------------------------------- 10.2/207.7 kB ? eta -:--:--
   ------- ------------------------------- 41.0/207.7 kB 653.6 kB/s eta 0:00:01
   ---------------------------------------  204.8/207.7 kB 1.8 MB/s eta 0:00:01
   ---------------------------------------- 207.7/207.7 kB 1.8 MB/s eta 0:00:00
Installing collected packages: mysqlclient
Successfully installed mysqlclient-2.2.7

# Basic Query

#1

In [75]:
with engine.connect() as connection:
    result = connection.execute(text("Select * From Customers"))
    # print(result.fetchall())
    for i in result.fetchall():
        print(f"Customer_id : {i[0]} | First_name: {i[1]} | Last_name: {i[2]} | email : {i[3]} | phone_number: {i[4]} | created_at: {i[5]} ")

Customer_id : 1 | First_name: Regina | Last_name: Banks | email : kjones@petty.biz | phone_number: 374-831-2327-000 | created_at: 2022-11-20 19:15:32
Customer_id : 2 | First_name: Mark | Last_name: Pena | email : mercedes42@warner.com | phone_number: 001-698-370-1197-3825 | created_at: 2025-02-08 03:18:03
Customer_id : 3 | First_name: Amanda | Last_name: Carney | email : ricardosimmons@gmail.com | phone_number: 946-520-9112 | created_at: 2022-06-28 09:04:15
Customer_id : 4 | First_name: Brandon | Last_name: Lee | email : kelleycharles@hotmail.com | phone_number: 915-139-9155-10333 | created_at: 2023-03-06 14:40:08
Customer_id : 5 | First_name: Theresa | Last_name: Ramirez | email : amybrown@butler.biz | phone_number: (307)514-8871-86410 | created_at: 2024-08-19 05:20:11
Customer_id : 6 | First_name: William | Last_name: Hayden | email : kbailey@gmail.com | phone_number: +1-421-594-8798 | created_at: 2022-09-25 20:03:32
Customer_id : 7 | First_name: Sarah | Last_name: Mata | email : marshdakota@gmail.com | phone_number: +1-276-218-0867-89262 | created_at: 2024-03-16 18:46:30
Customer_id : 8 | First_name: Chad | Last_name: Kelley | email : cynthiaramos@hotmail.com | phone_number: 001-463-061-5912-78986 | created_at: 2023-10-11 14:46:09
Customer_id : 9 | First_name: Kirsten | Last_name: Duran | email : haley08@yahoo.com | phone_number: (539)142-8091-8797 | created_at: 2021-04-05 09:22:27
Customer_id : 10 | First_name: Carla | Last_name: Young | email : csoto@yahoo.com | phone_number: +1-934-064-2110-462 | created_at: 2021-08-19 12:37:48
Customer_id : 11 | First_name: Linda | Last_name: Rivera | email : jbrown@goodman.com | phone_number: 556-589-5451-5831 | created_at: 2021-11-19 20:15:45
Customer_id : 12 | First_name: Marcia | Last_name: Hoffman | email : xmurillo@yahoo.com | phone_number: 095-837-9913 | created_at: 2023-04-14 16:58:49
Customer_id : 13 | First_name: Sandra | Last_name: Martinez | email : benjamingregory@green-benson.com | phone_number: (390)659-9795-87739 | created_at: 2024-01-25 15:55:22
Customer_id : 14 | First_name: Christian | Last_name: Thompson | email : nathanielhughes@hotmail.com | phone_number: (551)142-2216-33019 | created_at: 2021-08-28 05:36:48
Customer_id : 15 | First_name: Yolanda | Last_name: Smith | email : gregory05@gmail.com | phone_number: None | created_at: 2021-09-25 23:41:12
Customer_id : 16 | First_name: Jennifer | Last_name: Ellis | email : trodriguez@stafford.com | phone_number: 289-002-5709-0694 | created_at: 2024-01-01 06:27:46
Customer_id : 17 | First_name: Greg | Last_name: Patterson | email : uayala@king.org | phone_number: 019-426-6713-484 | created_at: 2020-06-25 15:34:54
Customer_id : 18 | First_name: Kiara | Last_name: Dean | email : grantnichole@mosley.com | phone_number: (953)712-6958-27155 | created_at: 2021-08-09 17:25:37
Customer_id : 19 | First_name: Robert | Last_name: Gardner | email : montgomeryelizabeth@yahoo.com | phone_number: 511-997-2755-41172 | created_at: 2021-08-17 19:34:40
Customer_id : 20 | First_name: Bobby | Last_name: Oliver | email : beardsylvia@kelley.com | phone_number: 795-826-0066-4663 | created_at: 2021-08-16 04:33:27
Customer_id : 21 | First_name: Kevin | Last_name: Bond | email : lbaxter@yahoo.com | phone_number: 541-799-8722 | created_at: 2022-11-19 17:38:04
Customer_id : 22 | First_name: Tammy | Last_name: Byrd | email : williamsonsabrina@hotmail.com | phone_number: (422)557-1760-202 | created_at: 2024-01-15 00:22:13
Customer_id : 23 | First_name: Steven | Last_name: Cooper | email : trichardson@reed.net | phone_number: 184-556-2371-1253 | created_at: 2024-02-20 20:51:27
Customer_id : 24 | First_name: Claire | Last_name: Johnson | email : molinacole@ross-butler.com | phone_number: 628-556-9704-917 | created_at: 2023-09-09 16:59:15
Customer_id : 25 | First_name: Kyle | Last_name: Ward | email : lmiller@leblanc.com | phone_number: (763)728-3334-54957 | created_at: 2021-11-26 01:38:58
Customer_id : 26 | First_name: Melissa | Last_name: Taylor | email : kimberlychoi@gardner.info | phone_number: 763-597-9534-2265 | created_at: 2020-03-02 07:42:47
Customer_id : 27 | First_name: Joann | Last_name: Chan | email : dyermalik@gmail.com | phone_number: 496-353-2505-9952 | created_at: 2023-07-09 00:49:14
Customer_id : 28 | First_name: Sarah | Last_name: Mack | email : wagnerjoshua@hotmail.com | phone_number: 834-449-0222 | created_at: 2024-08-10 18:00:57
Customer_id : 29 | First_name: Keith | Last_name: Huang | email : lamblaura@gmail.com | phone_number: 192-627-2296-88391 | created_at: 2021-10-17 09:22:58
Customer_id : 30 | First_name: James | Last_name: Lewis | email : gregoryburke@riddle.biz | phone_number: (084)640-3466 | created_at: 2021-09-13 11:21:30
Customer_id : 31 | First_name: Theresa | Last_name: Rose | email : waltersbrenda@alexander.com | phone_number: +1-524-361-7547 | created_at: 2023-05-23 00:55:59
Customer_id : 32 | First_name: Greg | Last_name: Moran | email : anna36@wilson-nelson.com | phone_number: +1-335-289-6708-76508 | created_at: 2022-08-14 16:22:39
Customer_id : 33 | First_name: Lisa | Last_name: Monroe | email : scott03@pacheco.com | phone_number: 128-021-5236-15225 | created_at: 2020-07-04 13:33:53
Customer_id : 34 | First_name: Monica | Last_name: Hutchinson | email : qthompson@gmail.com | phone_number: 259-333-1448-8738 | created_at: 2022-07-02 12:56:25
Customer_id : 35 | First_name: Tammy | Last_name: Donaldson | email : derekwilson@ford.net | phone_number: +1-576-100-8214-558 | created_at: 2024-03-23 23:06:46
Customer_id : 36 | First_name: John | Last_name: Webb | email : robert65@morris.biz | phone_number: 904-328-8185-798 | created_at: 2022-07-23 11:11:54
Customer_id : 37 | First_name: Tommy | Last_name: Carter | email : anna12@gmail.com | phone_number: 001-763-119-5457-72779 | created_at: 2022-05-07 16:23:07
Customer_id : 38 | First_name: Anthony | Last_name: Cooper | email : eric29@adams.com | phone_number: +1-592-359-4637-50349 | created_at: 2022-05-18 17:54:49
Customer_id : 39 | First_name: Maria | Last_name: Lucas | email : rivasaaron@yahoo.com | phone_number: +1-902-761-3089 | created_at: 2025-02-07 04:44:47
Customer_id : 40 | First_name: Stephen | Last_name: Perez | email : charles42@roberts.com | phone_number: 115-579-8539-07775 | created_at: 2020-11-02 16:22:32
Customer_id : 41 | First_name: Roger | Last_name: Benson | email : nicole15@yahoo.com | phone_number: 213-106-8026-68976 | created_at: 2022-02-15 21:27:34
Customer_id : 42 | First_name: Monica | Last_name: Ford | email : mooneykaren@yahoo.com | phone_number: 011-551-2736-980 | created_at: 2021-02-17 09:36:57
Customer_id : 43 | First_name: Eric | Last_name: Shannon | email : ojohnson@hotmail.com | phone_number: 001-030-722-2002-9945 | created_at: 2023-03-18 12:23:26
Customer_id : 44 | First_name: Chelsea | Last_name: Murray | email : gvincent@yahoo.com | phone_number: 524-944-2841 | created_at: 2024-11-26 08:19:45
Customer_id : 45 | First_name: Gerald | Last_name: Hernandez | email : ericgarcia@oliver-marsh.com | phone_number: 001-010-268-7718-691 | created_at: 2024-10-22 10:04:32
Customer_id : 46 | First_name: Sherry | Last_name: Warner | email : paulmartin@mason.com | phone_number: None | created_at: 2021-04-18 00:04:06
Customer_id : 47 | First_name: Yolanda | Last_name: Crawford | email : abrown@yahoo.com | phone_number: 001-346-030-0839-1958 | created_at: 2023-11-19 16:01:54
Customer_id : 48 | First_name: Stephanie | Last_name: Chavez | email : jjohnson@moore.com | phone_number: 045-551-9274-93255 | created_at: 2020-09-30 17:55:33
Customer_id : 49 | First_name: Veronica | Last_name: Williams | email : cobrien@hotmail.com | phone_number: +1-989-670-4985 | created_at: 2021-10-03 04:55:27
Customer_id : 50 | First_name: Connie | Last_name: Curtis | email : jennifermiranda@hotmail.com | phone_number: None | created_at: 2022-11-29 20:19:39
Customer_id : 51 | First_name: Scott | Last_name: Jones | email : benjaminhiggins@stewart.org | phone_number: (728)180-6959-348 | created_at: 2024-12-21 21:19:45
Customer_id : 52 | First_name: Edward | Last_name: Brandt | email : julia66@clark.com | phone_number: 200-043-9494 | created_at: 2020-04-04 07:53:56
Customer_id : 53 | First_name: Michael | Last_name: Rose | email : rosejohnny@jones.com | phone_number: None | created_at: 2021-05-29 18:35:29
Customer_id : 54 | First_name: Latoya | Last_name: Lopez | email : sarahknight@hotmail.com | phone_number: 697-261-2992 | created_at: 2024-10-25 16:59:46
Customer_id : 55 | First_name: Melissa | Last_name: Rodriguez | email : zacharyroberts@valdez.org | phone_number: 689-166-6488-926 | created_at: 2021-01-03 20:14:55
Customer_id : 56 | First_name: Laurie | Last_name: Clements | email : matthew29@yahoo.com | phone_number: (716)049-0731 | created_at: 2021-09-19 23:05:55
Customer_id : 57 | First_name: Alexander | Last_name: Wilkins | email : tara95@hotmail.com | phone_number: +1-056-057-7386 | created_at: 2023-12-30 07:06:56
Customer_id : 58 | First_name: Melissa | Last_name: Cruz | email : gilbertdawson@tapia.com | phone_number: 480-340-1808-84978 | created_at: 2020-04-02 15:43:18
Customer_id : 59 | First_name: Emily | Last_name: Garcia | email : mark05@collins-hart.org | phone_number: +1-383-799-5509-84709 | created_at: 2024-01-09 21:43:00
Customer_id : 60 | First_name: Andrew | Last_name: Walker | email : ybrown@chavez.com | phone_number: 203-466-9417-4777 | created_at: 2021-11-02 08:23:21
Customer_id : 61 | First_name: Michael | Last_name: Holder | email : phillipwebster@gmail.com | phone_number: 001-642-658-9630 | created_at: 2022-06-05 15:07:48
Customer_id : 62 | First_name: Chelsea | Last_name: Flores | email : daviskathryn@yahoo.com | phone_number: (395)021-2170 | created_at: 2023-04-17 21:51:24
Customer_id : 63 | First_name: Brian | Last_name: Wilkerson | email : janetfields@yahoo.com | phone_number: 001-103-935-9366-783 | created_at: 2020-03-16 21:23:37
Customer_id : 64 | First_name: Jennifer | Last_name: Smith | email : cooperheather@hotmail.com | phone_number: None | created_at: 2022-10-20 13:36:01
Customer_id : 65 | First_name: Henry | Last_name: Pierce | email : nathaniel97@keller.com | phone_number: +1-785-415-5062-9058 | created_at: 2024-10-28 23:19:35
Customer_id : 66 | First_name: Mary | Last_name: Lee | email : alyssajohnson@allen-wheeler.info | phone_number: 001-854-259-7862-12535 | created_at: 2020-12-28 19:57:08
Customer_id : 67 | First_name: Carl | Last_name: Andrews | email : marybird@hayden.com | phone_number: (179)915-3476-4754 | created_at: 2021-06-27 01:27:38
Customer_id : 68 | First_name: Fernando | Last_name: Gardner | email : james14@hotmail.com | phone_number: 041-124-5207-173 | created_at: 2021-04-13 13:24:29
Customer_id : 69 | First_name: Amanda | Last_name: Diaz | email : clayton51@berry-norton.com | phone_number: 719-233-9622 | created_at: 2023-02-18 05:10:37
Customer_id : 70 | First_name: Emily | Last_name: Rodriguez | email : christopherspence@morris.com | phone_number: 001-534-030-1109-8134 | created_at: 2024-02-04 13:28:32
Customer_id : 71 | First_name: Samantha | Last_name: Price | email : hodgeaudrey@gmail.com | phone_number: 232-322-3510-760 | created_at: 2020-03-05 11:22:12
Customer_id : 72 | First_name: Tammy | Last_name: Chavez | email : thomaskyle@orozco.com | phone_number: 001-629-480-6549 | created_at: 2020-04-15 06:05:20
Customer_id : 73 | First_name: Dillon | Last_name: Berg | email : chamberscarol@griffin.com | phone_number: +1-376-548-8725-133 | created_at: 2021-11-13 09:37:52
Customer_id : 74 | First_name: Shawn | Last_name: Brown | email : sheila54@henderson.com | phone_number: +1-332-380-7494-441 | created_at: 2021-05-05 15:15:02
Customer_id : 75 | First_name: Gloria | Last_name: Ferrell | email : joneschristopher@chang.com | phone_number: 158-057-4906-6646 | created_at: 2021-10-25 03:35:33
Customer_id : 76 | First_name: Veronica | Last_name: Maldonado | email : englishrodney@gmail.com | phone_number: (553)109-9477-8894 | created_at: 2021-10-28 07:34:58
Customer_id : 77 | First_name: Samuel | Last_name: Austin | email : jamiebaker@lopez-arnold.biz | phone_number: 950-637-5057-621 | created_at: 2022-08-12 19:07:32
Customer_id : 78 | First_name: Connie | Last_name: Love | email : lararobert@atkinson-winters.biz | phone_number: 001-480-406-9050-0839 | created_at: 2023-02-17 02:50:02
Customer_id : 79 | First_name: Joseph | Last_name: Myers | email : nmorris@yahoo.com | phone_number: (842)727-5588 | created_at: 2023-10-15 17:29:50
Customer_id : 80 | First_name: Carrie | Last_name: Hughes | email : jaimekline@hotmail.com | phone_number: 439-829-3760 | created_at: 2022-05-10 10:22:20
Customer_id : 81 | First_name: Christopher | Last_name: Howard | email : john25@gmail.com | phone_number: 001-461-685-1080-48876 | created_at: 2021-12-15 05:08:18
Customer_id : 82 | First_name: Thomas | Last_name: Steele | email : mckinneychristopher@adams.com | phone_number: None | created_at: 2021-05-13 02:55:17
Customer_id : 83 | First_name: Derrick | Last_name: Hansen | email : carmen20@yahoo.com | phone_number: +1-435-569-6259 | created_at: 2023-06-09 22:19:14
Customer_id : 84 | First_name: Gabrielle | Last_name: Curry | email : david57@hotmail.com | phone_number: 001-205-438-0008-139 | created_at: 2024-09-27 19:51:44
Customer_id : 85 | First_name: Jason | Last_name: Arellano | email : wgomez@hotmail.com | phone_number: +1-405-154-6716-107 | created_at: 2022-05-22 14:02:13
Customer_id : 86 | First_name: Glenda | Last_name: Sampson | email : darrylford@meyers-peterson.org | phone_number: (061)301-2780-04625 | created_at: 2021-04-16 12:14:36
Customer_id : 87 | First_name: John | Last_name: Vargas | email : michele75@faulkner.org | phone_number: 062-756-0129-045 | created_at: 2022-05-06 18:53:11
Customer_id : 88 | First_name: Jose | Last_name: Robinson | email : landryregina@cooper.com | phone_number: 212-225-6136-808 | created_at: 2022-09-30 07:33:02
Customer_id : 89 | First_name: Melissa | Last_name: Murray | email : richard15@fernandez-smith.biz | phone_number: 113-413-9311 | created_at: 2021-03-14 00:08:21
Customer_id : 90 | First_name: James | Last_name: Moore | email : amy36@contreras-allen.com | phone_number: 071-943-2610-2666 | created_at: 2020-02-03 16:15:09
Customer_id : 91 | First_name: Larry | Last_name: Lee | email : dpowers@hotmail.com | phone_number: +1-407-986-0333-883 | created_at: 2024-02-03 16:59:56
Customer_id : 92 | First_name: Andrea | Last_name: Jenkins | email : piercejohn@gonzales.com | phone_number: (406)192-5207 | created_at: 2022-07-31 01:21:22
Customer_id : 93 | First_name: Brenda | Last_name: Edwards | email : harrisalexander@flores.com | phone_number: 611-937-8361-4071 | created_at: 2025-01-28 13:09:28
Customer_id : 94 | First_name: Denise | Last_name: Sullivan | email : alyssa10@vaughn-scott.com | phone_number: +1-434-260-4446 | created_at: 2021-03-24 18:42:42
Customer_id : 95 | First_name: Kathleen | Last_name: Gardner | email : marilyn16@hotmail.com | phone_number: 001-065-411-3296-274 | created_at: 2023-02-13 12:28:07
Customer_id : 96 | First_name: Brittany | Last_name: Lopez | email : ysanchez@duncan.com | phone_number: 149-832-9366-605 | created_at: 2021-07-05 15:29:03
Customer_id : 97 | First_name: Benjamin | Last_name: Cantrell | email : crystal86@wells.com | phone_number: 143-924-3829-64356 | created_at: 2021-10-08 11:21:26
Customer_id : 98 | First_name: Bailey | Last_name: Jones | email : carrollcharles@yahoo.com | phone_number: 001-660-204-0662-57909 | created_at: 2022-12-06 18:54:50
Customer_id : 99 | First_name: Adam | Last_name: Perkins | email : uluna@smith.net | phone_number: (675)384-0611-255 | created_at: 2020-10-22 06:07:08
Customer_id : 100 | First_name: Patrick | Last_name: Bond | email : daniel94@smith.net | phone_number: 916-323-1800-44661 | created_at: 2021-06-01 06:39:22

#2

In [77]:
with engine.connect() as connection:
    result = connection.execute(text("Select order_id,total_amount,status From Orders"))
    for i in result.fetchall():
        print(f"order_id : {i[0]} | total_amount: {i[1]} | status: {i[2]}")

order_id : 1 | total_amount: 163.94 | status: Delivered
order_id : 2 | total_amount: 334.71 | status: Shipped
order_id : 3 | total_amount: 674.77 | status: Cancelled
order_id : 4 | total_amount: 995.61 | status: Delivered
order_id : 5 | total_amount: 747.65 | status: Shipped
order_id : 6 | total_amount: 183.19 | status: Pending
order_id : 7 | total_amount: 411.78 | status: Delivered
order_id : 8 | total_amount: 290.48 | status: Delivered
order_id : 9 | total_amount: 853.37 | status: Delivered
order_id : 10 | total_amount: 103.04 | status: Pending
order_id : 11 | total_amount: 268.62 | status: Shipped
order_id : 12 | total_amount: 120.23 | status: Cancelled
order_id : 13 | total_amount: 199.35 | status: Delivered
order_id : 14 | total_amount: 826.74 | status: Pending
order_id : 15 | total_amount: 626.79 | status: Pending
order_id : 16 | total_amount: 338.49 | status: Delivered
order_id : 17 | total_amount: 584.62 | status: Shipped
order_id : 18 | total_amount: 172.94 | status: Cancelled
order_id : 19 | total_amount: 513.01 | status: Shipped
order_id : 20 | total_amount: 941.82 | status: Shipped
order_id : 21 | total_amount: 533.45 | status: Delivered
order_id : 22 | total_amount: 193.79 | status: Delivered
order_id : 23 | total_amount: 119.62 | status: Pending
order_id : 24 | total_amount: 507.69 | status: Shipped
order_id : 25 | total_amount: 721.21 | status: Shipped
order_id : 26 | total_amount: 49.76 | status: Cancelled
order_id : 27 | total_amount: 990.86 | status: Cancelled
order_id : 28 | total_amount: 103.3 | status: Delivered
order_id : 29 | total_amount: 404.65 | status: Pending
order_id : 30 | total_amount: 214.58 | status: Shipped
order_id : 31 | total_amount: 80.87 | status: Cancelled
order_id : 32 | total_amount: 227.97 | status: Pending
order_id : 33 | total_amount: 758.03 | status: Shipped
order_id : 34 | total_amount: 97.31 | status: Delivered
order_id : 35 | total_amount: 361.98 | status: Shipped
order_id : 36 | total_amount: 62.89 | status: Pending
order_id : 37 | total_amount: 16.18 | status: Delivered
order_id : 38 | total_amount: 515.95 | status: Pending
order_id : 39 | total_amount: 306.57 | status: Delivered
order_id : 40 | total_amount: 593.82 | status: Pending
order_id : 41 | total_amount: 795.23 | status: Cancelled
order_id : 42 | total_amount: 595.47 | status: Shipped
order_id : 43 | total_amount: 154.51 | status: Delivered
order_id : 44 | total_amount: 543.05 | status: Pending
order_id : 45 | total_amount: 49.64 | status: Delivered
order_id : 46 | total_amount: 745.9 | status: Delivered
order_id : 47 | total_amount: 579.53 | status: Shipped
order_id : 48 | total_amount: 651.39 | status: Pending
order_id : 49 | total_amount: 696.55 | status: Delivered
order_id : 50 | total_amount: 322.28 | status: Cancelled
order_id : 51 | total_amount: 832.91 | status: Cancelled
order_id : 52 | total_amount: 590.2 | status: Delivered
order_id : 53 | total_amount: 220.89 | status: Pending
order_id : 54 | total_amount: 644.08 | status: Delivered
order_id : 55 | total_amount: 467.97 | status: Delivered
order_id : 56 | total_amount: 991.92 | status: Cancelled
order_id : 57 | total_amount: 10.15 | status: Shipped
order_id : 58 | total_amount: 725.54 | status: Shipped
order_id : 59 | total_amount: 42.92 | status: Cancelled
order_id : 60 | total_amount: 194.28 | status: Delivered
order_id : 61 | total_amount: 803.64 | status: Delivered
order_id : 62 | total_amount: 635.0 | status: Pending
order_id : 63 | total_amount: 824.39 | status: Pending
order_id : 64 | total_amount: 753.44 | status: Cancelled
order_id : 65 | total_amount: 755.98 | status: Cancelled
order_id : 66 | total_amount: 55.79 | status: Pending
order_id : 67 | total_amount: 557.78 | status: Shipped
order_id : 68 | total_amount: 188.96 | status: Pending
order_id : 69 | total_amount: 855.83 | status: Pending
order_id : 70 | total_amount: 877.0 | status: Shipped
order_id : 71 | total_amount: 626.03 | status: Shipped
order_id : 72 | total_amount: 490.96 | status: Shipped
order_id : 73 | total_amount: 286.8 | status: Shipped
order_id : 74 | total_amount: 599.59 | status: Pending
order_id : 75 | total_amount: 167.41 | status: Delivered
order_id : 76 | total_amount: 338.45 | status: Pending
order_id : 77 | total_amount: 549.57 | status: Shipped
order_id : 78 | total_amount: 717.82 | status: Delivered
order_id : 79 | total_amount: 888.58 | status: Pending
order_id : 80 | total_amount: 887.38 | status: Cancelled
order_id : 81 | total_amount: 669.01 | status: Cancelled
order_id : 82 | total_amount: 202.95 | status: Cancelled
order_id : 83 | total_amount: 471.36 | status: Pending
order_id : 84 | total_amount: 769.94 | status: Shipped
order_id : 85 | total_amount: 588.13 | status: Delivered
order_id : 86 | total_amount: 15.36 | status: Delivered
order_id : 87 | total_amount: 479.85 | status: Delivered
order_id : 88 | total_amount: 21.38 | status: Shipped
order_id : 89 | total_amount: 979.59 | status: Pending
order_id : 90 | total_amount: 486.03 | status: Shipped
order_id : 91 | total_amount: 760.92 | status: Shipped
order_id : 92 | total_amount: 246.43 | status: Pending
order_id : 93 | total_amount: 823.55 | status: Delivered
order_id : 94 | total_amount: 130.91 | status: Delivered
order_id : 95 | total_amount: 60.06 | status: Shipped
order_id : 96 | total_amount: 994.66 | status: Delivered
order_id : 97 | total_amount: 196.86 | status: Delivered
order_id : 98 | total_amount: 873.52 | status: Pending
order_id : 99 | total_amount: 233.56 | status: Shipped
order_id : 100 | total_amount: 775.0 | status: Delivered
order_id : 101 | total_amount: 980.75 | status: Shipped
order_id : 102 | total_amount: 761.21 | status: Pending
order_id : 103 | total_amount: 745.19 | status: Pending
order_id : 104 | total_amount: 973.59 | status: Pending
order_id : 105 | total_amount: 43.07 | status: Cancelled
order_id : 106 | total_amount: 467.0 | status: Cancelled
order_id : 107 | total_amount: 595.18 | status: Cancelled
order_id : 108 | total_amount: 913.92 | status: Shipped
order_id : 109 | total_amount: 196.67 | status: Shipped
order_id : 110 | total_amount: 800.08 | status: Pending
order_id : 111 | total_amount: 989.71 | status: Delivered
order_id : 112 | total_amount: 150.09 | status: Shipped
order_id : 113 | total_amount: 972.73 | status: Pending
order_id : 114 | total_amount: 993.5 | status: Pending
order_id : 115 | total_amount: 462.63 | status: Shipped
order_id : 116 | total_amount: 872.58 | status: Shipped
order_id : 117 | total_amount: 410.65 | status: Shipped
order_id : 118 | total_amount: 150.1 | status: Pending
order_id : 119 | total_amount: 208.26 | status: Cancelled
order_id : 120 | total_amount: 146.48 | status: Cancelled
order_id : 121 | total_amount: 235.56 | status: Delivered
order_id : 122 | total_amount: 903.18 | status: Pending
order_id : 123 | total_amount: 913.81 | status: Delivered
order_id : 124 | total_amount: 444.97 | status: Delivered
order_id : 125 | total_amount: 293.63 | status: Cancelled
order_id : 126 | total_amount: 511.8 | status: Cancelled
order_id : 127 | total_amount: 277.38 | status: Shipped
order_id : 128 | total_amount: 358.84 | status: Pending
order_id : 129 | total_amount: 467.19 | status: Shipped
order_id : 130 | total_amount: 388.66 | status: Pending
order_id : 131 | total_amount: 692.94 | status: Cancelled
order_id : 132 | total_amount: 389.99 | status: Pending
order_id : 133 | total_amount: 499.86 | status: Pending
order_id : 134 | total_amount: 475.97 | status: Delivered
order_id : 135 | total_amount: 329.2 | status: Pending
order_id : 136 | total_amount: 526.31 | status: Delivered
order_id : 137 | total_amount: 40.65 | status: Delivered
order_id : 138 | total_amount: 316.82 | status: Cancelled
order_id : 139 | total_amount: 580.47 | status: Delivered
order_id : 140 | total_amount: 370.76 | status: Pending
order_id : 141 | total_amount: 236.26 | status: Pending
order_id : 142 | total_amount: 47.53 | status: Cancelled
order_id : 143 | total_amount: 664.77 | status: Pending
order_id : 144 | total_amount: 109.67 | status: Delivered
order_id : 145 | total_amount: 529.63 | status: Cancelled
order_id : 146 | total_amount: 569.61 | status: Cancelled
order_id : 147 | total_amount: 604.04 | status: Cancelled
order_id : 148 | total_amount: 676.35 | status: Shipped
order_id : 149 | total_amount: 450.22 | status: Shipped
order_id : 150 | total_amount: 405.1 | status: Cancelled
order_id : 151 | total_amount: 497.15 | status: Shipped
order_id : 152 | total_amount: 263.12 | status: Cancelled
order_id : 153 | total_amount: 85.07 | status: Shipped
order_id : 154 | total_amount: 749.5 | status: Cancelled
order_id : 155 | total_amount: 864.76 | status: Delivered
order_id : 156 | total_amount: 876.59 | status: Cancelled
order_id : 157 | total_amount: 703.48 | status: Delivered
order_id : 158 | total_amount: 166.97 | status: Cancelled
order_id : 159 | total_amount: 374.54 | status: Delivered
order_id : 160 | total_amount: 503.02 | status: Pending
order_id : 161 | total_amount: 879.55 | status: Pending
order_id : 162 | total_amount: 630.53 | status: Pending
order_id : 163 | total_amount: 458.08 | status: Shipped
order_id : 164 | total_amount: 122.18 | status: Delivered
order_id : 165 | total_amount: 357.56 | status: Delivered
order_id : 166 | total_amount: 614.44 | status: Delivered
order_id : 167 | total_amount: 559.53 | status: Pending
order_id : 168 | total_amount: 523.15 | status: Cancelled
order_id : 169 | total_amount: 666.77 | status: Cancelled
order_id : 170 | total_amount: 901.36 | status: Shipped
order_id : 171 | total_amount: 820.06 | status: Cancelled
order_id : 172 | total_amount: 618.47 | status: Pending
order_id : 173 | total_amount: 476.13 | status: Delivered
order_id : 174 | total_amount: 503.47 | status: Shipped
order_id : 175 | total_amount: 197.03 | status: Delivered
order_id : 176 | total_amount: 134.45 | status: Shipped
order_id : 177 | total_amount: 854.87 | status: Pending
order_id : 178 | total_amount: 693.8 | status: Shipped
order_id : 179 | total_amount: 494.6 | status: Delivered
order_id : 180 | total_amount: 868.6 | status: Shipped
order_id : 181 | total_amount: 223.01 | status: Shipped
order_id : 182 | total_amount: 671.79 | status: Shipped
order_id : 183 | total_amount: 391.22 | status: Delivered
order_id : 184 | total_amount: 454.75 | status: Cancelled
order_id : 185 | total_amount: 31.87 | status: Cancelled
order_id : 186 | total_amount: 314.85 | status: Cancelled
order_id : 187 | total_amount: 983.56 | status: Cancelled
order_id : 188 | total_amount: 855.8 | status: Cancelled
order_id : 189 | total_amount: 830.25 | status: Delivered
order_id : 190 | total_amount: 109.66 | status: Shipped
order_id : 191 | total_amount: 529.97 | status: Cancelled
order_id : 192 | total_amount: 546.68 | status: Delivered
order_id : 193 | total_amount: 227.4 | status: Delivered
order_id : 194 | total_amount: 80.31 | status: Delivered
order_id : 195 | total_amount: 981.0 | status: Shipped
order_id : 196 | total_amount: 773.95 | status: Shipped
order_id : 197 | total_amount: 871.39 | status: Cancelled
order_id : 198 | total_amount: 712.46 | status: Shipped
order_id : 199 | total_amount: 104.72 | status: Delivered
order_id : 200 | total_amount: 52.29 | status: Pending

#3

In [89]:
with engine.connect() as conn:
    res = conn.execute(text("Select product_id,product_name From Products Where category LIKE 'Electronics'"))
    for i in res.fetchall():
        print(f'product_id: {i[0]} | product_name: {i[1]}')

product_id: 3 | product_name: True Gadget
product_id: 8 | product_name: Shoulder Tool
product_id: 12 | product_name: Out Accessory
product_id: 24 | product_name: Break Wear
product_id: 30 | product_name: Cell Tool
product_id: 34 | product_name: Myself Device
product_id: 48 | product_name: Pm Tool
product_id: 57 | product_name: Away Wear
product_id: 58 | product_name: Much Gadget
product_id: 60 | product_name: Job Wear
product_id: 71 | product_name: Several Tool
product_id: 75 | product_name: Person Accessory
product_id: 92 | product_name: Girl Tool
product_id: 99 | product_name: Address Device

#Intermediate Query

#4

In [101]:
with engine.connect() as connection:
    result = connection.execute(text("Select CONCAT(c.first_name,' ',c.last_name) as customer_name,COUNT(o.order_id) as Orders_placed From Customers as c JOIN Orders as o ON c.customer_id = o.customer_id Group By customer_name Order By Orders_placed DESC"))
    for i in result.fetchall():
        print(f'customer_name : {i[0]} | Orders_Placed : {i[1]}')

customer_name : Benjamin Cantrell | Orders_Placed : 5
customer_name : Marcia Hoffman | Orders_Placed : 5
customer_name : Tammy Byrd | Orders_Placed : 5
customer_name : Veronica Williams | Orders_Placed : 5
customer_name : Greg Moran | Orders_Placed : 5
customer_name : Joseph Myers | Orders_Placed : 5
customer_name : Amanda Carney | Orders_Placed : 4
customer_name : Sandra Martinez | Orders_Placed : 4
customer_name : Latoya Lopez | Orders_Placed : 4
customer_name : Carla Young | Orders_Placed : 4
customer_name : Stephanie Chavez | Orders_Placed : 4
customer_name : Andrew Walker | Orders_Placed : 4
customer_name : Melissa Murray | Orders_Placed : 4
customer_name : Shawn Brown | Orders_Placed : 3
customer_name : Dillon Berg | Orders_Placed : 3
customer_name : Emily Rodriguez | Orders_Placed : 3
customer_name : Steven Cooper | Orders_Placed : 3
customer_name : Mark Pena | Orders_Placed : 3
customer_name : Brian Wilkerson | Orders_Placed : 3
customer_name : Monica Hutchinson | Orders_Placed : 3
customer_name : Joann Chan | Orders_Placed : 3
customer_name : Melissa Rodriguez | Orders_Placed : 3
customer_name : Keith Huang | Orders_Placed : 3
customer_name : Laurie Clements | Orders_Placed : 3
customer_name : John Webb | Orders_Placed : 3
customer_name : Sherry Warner | Orders_Placed : 3
customer_name : Gloria Ferrell | Orders_Placed : 3
customer_name : Bailey Jones | Orders_Placed : 3
customer_name : Anthony Cooper | Orders_Placed : 3
customer_name : Jason Arellano | Orders_Placed : 3
customer_name : Yolanda Smith | Orders_Placed : 3
customer_name : Andrea Jenkins | Orders_Placed : 3
customer_name : Brittany Lopez | Orders_Placed : 3
customer_name : Henry Pierce | Orders_Placed : 3
customer_name : Lisa Monroe | Orders_Placed : 2
customer_name : Tammy Donaldson | Orders_Placed : 2
customer_name : Maria Lucas | Orders_Placed : 2
customer_name : Eric Shannon | Orders_Placed : 2
customer_name : Yolanda Crawford | Orders_Placed : 2
customer_name : Edward Brandt | Orders_Placed : 2
customer_name : Michael Rose | Orders_Placed : 2
customer_name : Jennifer Smith | Orders_Placed : 2
customer_name : Alexander Wilkins | Orders_Placed : 2
customer_name : Melissa Cruz | Orders_Placed : 2
customer_name : Michael Holder | Orders_Placed : 2
customer_name : Fernando Gardner | Orders_Placed : 2
customer_name : Amanda Diaz | Orders_Placed : 2
customer_name : Samantha Price | Orders_Placed : 2
customer_name : Brandon Lee | Orders_Placed : 2
customer_name : Theresa Ramirez | Orders_Placed : 2
customer_name : Samuel Austin | Orders_Placed : 2
customer_name : Chad Kelley | Orders_Placed : 2
customer_name : Thomas Steele | Orders_Placed : 2
customer_name : Kirsten Duran | Orders_Placed : 2
customer_name : Glenda Sampson | Orders_Placed : 2
customer_name : Veronica Maldonado | Orders_Placed : 2
customer_name : Linda Rivera | Orders_Placed : 2
customer_name : James Moore | Orders_Placed : 2
customer_name : Jennifer Ellis | Orders_Placed : 2
customer_name : Denise Sullivan | Orders_Placed : 2
customer_name : Kathleen Gardner | Orders_Placed : 2
customer_name : Sarah Mack | Orders_Placed : 2
customer_name : James Lewis | Orders_Placed : 2
customer_name : John Vargas | Orders_Placed : 2
customer_name : Connie Love | Orders_Placed : 1
customer_name : Stephen Perez | Orders_Placed : 1
customer_name : Carrie Hughes | Orders_Placed : 1
customer_name : Claire Johnson | Orders_Placed : 1
customer_name : Derrick Hansen | Orders_Placed : 1
customer_name : Gabrielle Curry | Orders_Placed : 1
customer_name : Mary Lee | Orders_Placed : 1
customer_name : Carl Andrews | Orders_Placed : 1
customer_name : Chelsea Murray | Orders_Placed : 1
customer_name : Jose Robinson | Orders_Placed : 1
customer_name : Emily Garcia | Orders_Placed : 1
customer_name : Kevin Bond | Orders_Placed : 1
customer_name : Melissa Taylor | Orders_Placed : 1
customer_name : Brenda Edwards | Orders_Placed : 1
customer_name : Bobby Oliver | Orders_Placed : 1
customer_name : Robert Gardner | Orders_Placed : 1
customer_name : Scott Jones | Orders_Placed : 1
customer_name : Chelsea Flores | Orders_Placed : 1
customer_name : Kyle Ward | Orders_Placed : 1

#5

In [102]:
conn = engine.connect()

In [103]:
q5 = '''Select CONCAT(c.first_name," ",c.last_name) as customer_name,o.order_id as orders,o.status as order_status
From Customers as c
JOIN Orders as o
ON c.customer_id = o.customer_id'''

In [104]:
pd.read_sql(q5,conn)

      customer_name  orders order_status
0     Thomas Steele       1    Delivered
1       Carla Young       2      Shipped
2       Shawn Brown       3    Cancelled
3        Tammy Byrd       4    Delivered
4    Robert Gardner       5      Shipped
..              ...     ...          ...
195      Sarah Mack     196      Shipped
196    Bailey Jones     197    Cancelled
197       John Webb     198      Shipped
198  Glenda Sampson     199    Delivered
199     Keith Huang     200      Pending

[200 rows x 3 columns]

#6

In [105]:
q6 = ''' Select ROUND(SUM(total_amount)) as total_revenue From orders'''

In [106]:
pd.read_sql(q6,conn)

   total_revenue
0        99056.0

#7

In [107]:
q7 = ''' Select CONCAT(c.first_name," ",c.last_name) as customer_name,COUNT(o.order_id) as Orders_placed
From Customers as c
JOIN Orders as o
ON c.customer_id = o.customer_id
Group By customer_name
Having Orders_placed > 3
Order By Orders_placed DESC'''

In [108]:
pd.read_sql(q7,conn)

        customer_name  Orders_placed
0      Marcia Hoffman              5
1          Tammy Byrd              5
2          Greg Moran              5
3   Veronica Williams              5
4        Joseph Myers              5
5   Benjamin Cantrell              5
6       Amanda Carney              4
7         Carla Young              4
8     Sandra Martinez              4
9    Stephanie Chavez              4
10       Latoya Lopez              4
11      Andrew Walker              4
12     Melissa Murray              4

#8

In [109]:
q8 = '''Select order_id,customer_id,order_date,total_amount From Orders
Where order_id IN (Select order_id From Payments Where payment_status = "Completed")'''

In [110]:
pd.read_sql(q8,conn)

    order_id  customer_id          order_date  total_amount
0        197           98 2022-08-07 21:36:46        871.39
1        173           70 2021-09-04 19:53:14        476.13
2        107            5 2020-04-06 18:55:27        595.18
3         43            2 2020-09-11 12:37:42        154.51
4        126           83 2020-06-08 05:59:01        511.80
5        181           87 2021-12-22 04:33:53        223.01
6        183           13 2022-08-09 08:13:57        391.22
7         12           48 2020-11-02 04:56:48        120.23
8         95           49 2021-07-09 06:18:44         60.06
9         22           44 2021-11-25 17:50:02        193.79
10       119           53 2021-10-01 08:02:53        208.26
11       152           15 2020-10-28 06:28:01        263.12
12         8           92 2022-01-20 04:49:40        290.48
13        24           32 2023-06-15 10:05:14        507.69
14        91           30 2021-02-07 18:14:01        760.92
15        13           46 2020-09-09 18:51:47        199.35
16       178           10 2020-05-15 18:31:06        693.80
17       149           53 2023-10-08 19:59:42        450.22
18        85           33 2024-03-14 10:55:23        588.13
19        66           13 2021-03-04 05:59:54         55.79
20        48           79 2021-04-02 18:16:52        651.39
21       108           13 2022-06-02 07:21:10        913.92
22       196           28 2024-02-17 10:04:28        773.95
23       144           46 2022-02-08 15:07:41        109.67
24         6           68 2024-08-30 22:33:21        183.19
25         7           96 2021-05-10 03:40:06        411.78
26         4           22 2024-08-01 06:28:08        995.61
27       104           69 2020-12-22 10:05:03        973.59
28       100           89 2023-01-13 23:28:34        775.00
29       115           79 2021-06-25 14:57:50        462.63
30        36           73 2021-06-21 03:34:20         62.89
31       164           54 2022-03-22 03:04:51        122.18
32        19            4 2022-12-30 02:33:35        513.01
33       188           49 2021-02-27 18:26:28        855.80
34       123           85 2020-08-22 02:56:40        913.81
35        98           97 2021-04-13 07:27:40        873.52
36       102           94 2024-09-13 11:45:07        761.21
37       146           21 2024-03-21 20:43:53        569.61
38       140           55 2023-12-24 09:42:24        370.76
39         2           10 2022-05-11 02:09:15        334.71
40       136           27 2022-07-16 12:28:46        526.31
41       195            9 2020-12-13 16:16:22        981.00
42       192           43 2020-10-29 15:29:48        546.68
43        46           47 2022-11-24 07:28:52        745.90
44       114           66 2024-10-17 15:34:20        993.50
45        94           60 2020-02-01 13:59:13        130.91
46       190           94 2022-04-16 00:26:24        109.66

# Advanced Queries

#9

In [111]:
q9 = ''' Select CONCAT(c.first_name," ",c.last_name) as customer_name,ROUND(SUM(o.total_amount)) as Amount_Spent
From Customers as c
JOIN Orders as o
ON c.customer_id = o.customer_id
Group By customer_name
Order BY Amount_Spent desc
LIMIT 5'''

In [113]:
pd.read_sql(q9,conn)

       customer_name  Amount_Spent
0     Marcia Hoffman        3336.0
1         Tammy Byrd        3323.0
2  Benjamin Cantrell        3153.0
3        Carla Young        2558.0
4  Veronica Williams        2555.0

#10

In [114]:
q10 = ''' Select o.order_id,o.order_date From orders as o
JOIN payments as p
ON o.order_id = p.order_id
Where p.payment_status LIKE "Failed" or p.payment_status LIKE "Pending"'''

In [115]:
pd.read_sql(q10,conn)

    order_id          order_date
0        185 2020-09-17 08:28:41
1        141 2023-10-30 19:54:54
2         70 2024-07-09 08:22:36
3         65 2020-04-14 04:36:35
4         68 2020-11-27 09:04:22
..       ...                 ...
92        93 2024-03-13 15:07:35
93       170 2023-02-21 00:20:29
94        31 2024-06-03 23:01:53
95        77 2024-02-13 11:59:36
96         6 2024-08-30 22:33:21

[97 rows x 2 columns]

#11

In [116]:
q11 = ''' Select p.category,COUNT(o.Order_id) as number_of_orders From products as p
JOIN Orders as o
ON o.Product_id = p.product_id
Group By p.category
Order By number_of_orders DESC'''

In [117]:
pd.read_sql(q11,conn)

         category  number_of_orders
0           Books                39
1        Clothing                38
2            Toys                28
3     Electronics                28
4  Home & Kitchen                25
5          Sports                22
6          Beauty                20

#12

In [118]:
q12 = ''' Select o.order_id From orders as o
JOIN payments as p
ON o.order_id = p.order_id
Where (o.status LIKE "Delivered" or o.status LIKE "Shipped") 
and (p.payment_status LIKE "Failed" or p.payment_status LIKE "Pending" or p.payment_status LIKE "Refunded") '''

In [119]:
pd.read_sql(q12,conn)

    order_id
0         70
1         88
2        198
3         77
4         77
..       ...
71        93
72       100
73       170
74       153
75        77

[76 rows x 1 columns]

In [120]:
#13

In [121]:
q13 = ''' Select CONCAT(c.first_name," ",c.last_name) as customer_name,AVG(o.total_amount) as AOV
From Customers as c
JOIN Orders as o
ON c.customer_id = o.customer_id
Group By customer_name'''

In [122]:
pd.read_sql(q13,conn)

     customer_name         AOV
0    Thomas Steele  192.415000
1      Carla Young  639.417500
2      Shawn Brown  576.756667
3       Tammy Byrd  664.638000
4   Robert Gardner  747.650000
..             ...         ...
78    Bobby Oliver  876.590000
79  Brenda Edwards  503.020000
80  Chelsea Flores  854.870000
81    Emily Garcia  454.750000
82     Connie Love  830.250000

[83 rows x 2 columns]

# Business Oriented Problems

In [123]:
#14

In [124]:
q14 = '''Select payment_method,COUNT(order_id) as no_of_times_used From payments
Group By payment_method
Order By no_of_times_used DESC'''

In [125]:
pd.read_sql(q14,conn)

     payment_method  no_of_times_used
0  Cash On Delivery                48
1       Credit Card                45
2            PayPal                36
3        Debit Card                36
4     Bank Transfer                35

In [126]:
#15

In [127]:
q15 = '''Select (COUNT(order_id)/(Select COUNT(order_id) From orders))*100 as percentage_of_orders_Cancelled
From Orders where status = "Cancelled"'''

In [128]:
pd.read_sql(q15,conn)

   percentage_of_orders_Cancelled
0                            22.0

In [129]:
#16

In [130]:
q16 = ''' Select MONTH(order_date) as Month,COUNT(order_id) as total_orders From orders
Group BY MONTH(order_date)
Order BY total_orders DESC'''

In [131]:
pd.read_sql(q16,conn)

    Month  total_orders
0       1            22
1       2            22
2      11            20
3       6            18
4       3            18
5      10            17
6       5            16
7       9            16
8      12            15
9       4            13
10      8            12
11      7            11

# Data Validation

In [132]:
#10

In [133]:
q1 = 'Select customer_id From Orders Where customer_id NOT IN (select customer_id from customers)'

In [134]:
pd.read_sql(q1,conn)

Empty DataFrame
Columns: [customer_id]
Index: []

In [135]:
# Every order have valid customer_id

In [136]:
q2 = '''Select o.order_id From orders as o
JOIN payments as p
ON o.order_id = p.order_id
Where p.payment_status LIKE "Failed" or p.payment_status LIKE "Pending"'''

In [137]:
pd.read_sql(q2,conn)

    order_id
0        185
1        141
2         70
3         65
4         68
..       ...
92        93
93       170
94        31
95        77
96         6

[97 rows x 1 columns]

In [138]:
#This gives order id, where payment status is either failed or pending.

In [139]:
q3 = ''' Select order_id From Payments
Where order_id NOT IN (select order_id from orders)'''

In [140]:
pd.read_sql(q3,conn)

Empty DataFrame
Columns: [order_id]
Index: []

In [141]:
#This checks whether every order_id present in or referenced in Payment table  is related to orginal order_id present in orders table.